app/Controllers/visaTracking/Country.php

SELECT *
FROM `country`
ORDER BY `name` ASC
SELECT COUNT(*) AS `numrows`
FROM `country`
---
	public function index(): string
	{
		$data['params'] = [
			"rows" => '10',
			"pageno" => '1',
			"sort_by" => 'name',
			"sort_order" => 'asc',
			"keywords" => "",
		];
		$data["countries"] = $this->countryModel->orderBy("name", "asc")->findAll();
		$data["tRecords"] = $this->countryModel->countAllResults();