app/Controllers/visaTracking/District.php

SELECT *
FROM `states`
---
    public function index(): string
    {
        $data["params"] = [
            "rows" => "50",
            "pageno" => "1",
            "sort_by" => "name",
            "sort_order" => "asc",
            "keywords" => "",
        ];
        $data["state"] = $this->stateModel->findAll();