app/Controllers/visaTracking/Employees.php

    public function editEmployee()
    {
        $id = $this->request->getGet('id');
        $data['employee'] = $this->employeeModel->find($id);
        // print "<pre>"; print_r($data['employee']); print "</pre>";
        $data['passport_types'] = $this->employeeModel->getPassportTypes();
        $data['countries'] = $this->countryModel->findAll();
        $data['states'] = $this->stateModel->where('country_id', $data['employee']['country'])->findAll();
        $data['districts'] = $this->districtModel->where('state_id', $data['employee']['state'])->findAll();
        $data['employee_visa'] = $this->employeeVisaModel->where('employee_id', $id)->find();
        $data['family_details'] = $this->employeeFamilyModel->where('employee_id', $id)->find();
        $data['edu_qualifications'] = $this->educationalQualificationModel->findAll();

        $family_relations = $this->familyRelationModel->findAll();
        foreach ($family_relations as $f_key => $relation) {
            $data['relations'][$relation['id']] = $relation;
        }
        $data['visa_types'] = $this->visaTypeModel->findAll();
---
SELECT *
FROM `employees`
WHERE `employees`.`id` = '6'
SELECT *
FROM `country`
SELECT *
FROM `states`
WHERE `country_id` = '80'
SELECT *
FROM `districts`
WHERE `state_id` = '6'
SELECT *
FROM `employee_visa`
WHERE `employee_id` = '6'
SELECT *
FROM `employee_family`
WHERE `employee_id` = '6'
SELECT *
FROM `educational_qualification`
WHERE `educational_qualification`.`deleted_at` IS NULL
SELECT *
FROM `family_relation`
WHERE `family_relation`.`deleted_at` IS NULL
SELECT *
FROM `visa_types`

    public function updateEmployee()
    {
        if($this->request->getPost(csrf_token()) === csrf_hash())
        {
            $data['id'] = $this->request->getPost('id');
            $data['visa_id'] = $this->request->getPost('visa_id');
            $family_details = $this->employeeFamilyModel->where('employee_id', $data['id'])->find();
---
SELECT *
FROM `employee_family`
WHERE `employee_id` = '6'

            }
            $check = $this->validate($rules);
            if($check == TRUE) {
                $employee_info = $this->employeeModel->find($data['id']);
---
SELECT *
FROM `employees`
WHERE `employees`.`id` = '6'

                                  );

                print($message->sid);exit;*/
                $this->employeeVisaModel->update($data['visa_id'], $edit_visa_details);
                $update_employee = $this->employeeModel->update($data['id'],$edit_employee);
---
UPDATE `employee_visa` SET `visa_no` = 'KH6712S', `visa_type` = '6', `applied_date` = '2024-02-07', `issued_date` = '2024-02-08', `start_date` = '2024-04-10', `end_date` = '2024-11-20', `duration` = '7', `purpose` = 'Visiting Purpose', `address` = 'Texas', `place_of_issue` = 'Delhi', `updated_by` = '1', `updated_at` = '2024-06-05 12:55:03'
WHERE `employee_visa`.`id` IN ('7')
UPDATE `employees` SET `fname` = 'Naga sai', `lname` = 'Vamshi', `gender` = '1', `dob` = '1984-02-21', `mobile` = '8106143535', `alt_mobile` = '', `email` = 'naga@yahhoo.com', `place_of_birth` = 'Hyderabad', `passport_no` = 'S12397H', `passport_type` = '3', `passport_issued_date` = '2014-12-23', `passport_expiry_date` = '2024-05-22', `place_of_issue` = 'Delhi', `address1` = 'Gokul plots, Plot no 1295 1296 Flat no 303, 3rd floor SR White House, Venkata Ramana Colony, Kukatpally', `address2` = 'Road No. 3', `city` = 'Hyderabad', `district` = '160', `state` = '6', `country` = '80', `pincode` = '500072', `nationality` = 'Indian', `marital_status` = '2', `photo` = '1713770940_123aa220e71bd7edc847.png', `emergency_id` = '15', `emp_experience` = '5.00', `employee_status` = '0', `edu_qualification` = '1', `updated_by` = '1', `updated_at` = '2024-06-05 12:55:03'
WHERE `employees`.`id` IN ('6')