app/Models/User/UserModel.php

	public function getUserLoginDetails($username,$password)
	{
		$builder = $this->db->table('user u');
		$builder->select('u.*, r.rights');
		$builder->join('role r', 'r.id=u.role', 'left');
		$builder->where('u.status', 1);
		$builder->where('u.username', $username);
		$builder->where('u.password', $password);
		$builder->where('u.deleted_at', NULL);
		$qry = $builder->get();
---
SELECT `u`.*, `r`.`rights`
FROM `user` `u`
LEFT JOIN `role` `r` ON `r`.`id`=`u`.`role`
WHERE `u`.`status` = 1
AND `u`.`username` = 'admin'
AND `u`.`password` = '25d55ad283aa400af464c76d713c07ad'
AND `u`.`deleted_at` IS NULL