app/Models/visaTracking/DistrictModel.php

SELECT *
FROM `districts`
ORDER BY `name` ASC
 LIMIT 50
---
    public function getAllDistricts($params)
    {
        $this->builder->select('*');

        if (!empty($params['keywords'])) {
            $this->builder->like('name', $params['keywords']);
        }

        if (!empty($params['state_id'])) {
            $this->builder->where('state_id', $params['state_id']);
        }
        $this->builder->orderBy($params['sort_by'], $params['sort_order']);
        $this->builder->limit($params['rows'], (($params['pageno'] -1)*$params['rows']));
        $query = $this->builder->get();

SELECT COUNT(*) as tRecords
FROM `districts`
---
    public function countAllDistricts($params)
    {
        $this->builder->select('COUNT(*) as tRecords');