app/Models/visaTracking/EmployeeVisaModel.php

SELECT SUM(IF(DATEDIFF(end_date, CURRENT_DATE()) < 0, 1, 0)) as less_than_0, SUM(IF(DATEDIFF(end_date, CURRENT_DATE()) BETWEEN 0 AND 30, 1, 0)) as less_than_30, SUM(IF(DATEDIFF(end_date, CURRENT_DATE()) BETWEEN 31 AND 90, 1, 0)) as less_than_90
FROM `employee_visa`
WHERE `deleted_at` IS NULL
HAVING `less_than_0` > 0
OR `less_than_30` > 0
OR `less_than_90` > 0
---
    public function getVisaExpiryDetails()
    {
        $this->builder->select('SUM(IF(DATEDIFF(end_date, CURRENT_DATE()) < 0,1,0)) as less_than_0, SUM(IF(DATEDIFF(end_date, CURRENT_DATE()) BETWEEN 0 AND 30,1,0)) as less_than_30, SUM(IF(DATEDIFF(end_date,CURRENT_DATE()) BETWEEN 31 AND 90,1,0)) as less_than_90');
        $this->builder->where('deleted_at', NULL);
        $this->builder->having('less_than_0 >', 0);
        $this->builder->orHaving('less_than_30 >', 0);
        $this->builder->orHaving('less_than_90 >', 0);
        $qry = $this->builder->get();