app/Models/visaTracking/EmployeeModel.php

	public function getEmployeesExoprt($params, $cols, $i)
	{
		$this->builder->select("employees.code,$cols");
		$this->builder->join('districts d', 'employees.district = d.id','LEFT');
		$this->builder->join('states s', 'employees.state = s.id','LEFT');
		$this->builder->join('country c', 'employees.country = c.id','LEFT');
---
SELECT count(employees.id) as trecords
FROM `employees`
LEFT JOIN `employee_visa` `ev` ON `ev`.`employee_id`=`employees`.`id`
WHERE `employees`.`deleted_at` IS NULL

	public function getPassportTypes()
	{
		$qry_builder = $this->db->table('passport_types');
		return $qry_builder->select('*')->get()->getResultArray();
---
SELECT *
FROM `passport_types`

	public function getPassportExpiryDetails()
	{

		$this->builder->select('SUM(IF(DATEDIFF(passport_expiry_date, CURRENT_DATE()) < 0,1,0)) as less_than_0, SUM(IF(DATEDIFF(passport_expiry_date, CURRENT_DATE()) BETWEEN 0 AND 30,1,0)) as less_than_30, SUM(IF(DATEDIFF( passport_expiry_date,CURRENT_DATE()) BETWEEN 31 AND 90,1,0)) as less_than_90');
		$this->builder->where('deleted_at', NULL);
		$this->builder->having('less_than_0 >', 0);
		$this->builder->orHaving('less_than_30 >', 0);
		$this->builder->orHaving('less_than_90 >', 0);
		$qry = $this->builder->get();
---
SELECT SUM(IF(DATEDIFF(passport_expiry_date, CURRENT_DATE()) < 0, 1, 0)) as less_than_0, SUM(IF(DATEDIFF(passport_expiry_date, CURRENT_DATE()) BETWEEN 0 AND 30, 1, 0)) as less_than_30, SUM(IF(DATEDIFF( passport_expiry_date, CURRENT_DATE()) BETWEEN 31 AND 90, 1, 0)) as less_than_90
FROM `employees`
WHERE `deleted_at` IS NULL
HAVING `less_than_0` > 0
OR `less_than_30` > 0
OR `less_than_90` > 0