app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `employees`
SELECT COUNT(*) AS `numrows`
FROM `employees`
WHERE `employee_status` = 1
SELECT COUNT(*) AS `numrows`
FROM `employees`
WHERE `employee_status` = 0
---
    public function index(): string
    {
        $data['page'] = array(
            'title' => 'Dashboard',
            'page_title' => 'Home',
            'layout' => 1,
        );
        $data['tot_employees'] = $this->employeeModel->countAllResults();
        $data['active_employees'] = $this->employeeModel->where(['employee_status' => 1])->countAllResults();
        $data['inactive_employees'] = $this->employeeModel->where(['employee_status' => 0])->countAllResults();